# Taps
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'coreutils'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'pinentry-mac'
brew 'keychain'
brew 'koekeishiya/formulae/skhd'

# Containers
brew 'docker'
brew 'docker-compose'
brew 'docker-buildx'
brew 'colima'

# Pyenv & build dependencies
brew 'pyenv'
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'tcl-tk'
